src/InformationRegisters/ПорядокУчетаНМАБУ/ПорядокУчетаНМАБУ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПорядокУчетаНМАБУ</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>СостояниеБУ</name>
    <type>
      <types>EnumRef.СостоянияНМА</types>
    </type>
  </resources>
  <resources>
    <name>СостояниеНУ</name>
    <type>
      <types>EnumRef.СостоянияНМА</types>
    </type>
  </resources>
  <resources>
    <name>НачислятьАмортизациюБУ</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>НачислятьАмортизациюНУ</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СтатьяРасходовБУ</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
    </type>
  </resources>
  <resources>
    <name>АналитикаРасходовБУ</name>
    <type>
      <types>Characteristic.СтатьиРасходов</types>
    </type>
  </resources>
  <resources>
    <name>СтатьяРасходовНУ</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
    </type>
  </resources>
  <resources>
    <name>АналитикаРасходовНУ</name>
    <type>
      <types>Characteristic.СтатьиРасходов</types>
    </type>
  </resources>
  <resources>
    <name>ПередаватьРасходыВДругуюОрганизацию</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОрганизацияПолучательРасходов</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <resources>
    <name>СчетПередачиРасходов</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </resources>
  <resources>
    <name>СпособОтраженияРасходовБУ</name>
    <type>
      <types>DocumentRef.ИзменениеПараметровНМА</types>
      <types>DocumentRef.ИзменениеПараметровНМА2_4</types>
    </type>
  </resources>
  <resources>
    <name>СпособОтраженияРасходовНУ</name>
    <type>
      <types>DocumentRef.ИзменениеПараметровНМА</types>
      <types>DocumentRef.ИзменениеПараметровНМА2_4</types>
    </type>
  </resources>
  <resources>
    <name>НалогообложениеНДС</name>
    <type>
      <types>EnumRef.ТипыНалогообложенияНДС</types>
    </type>
  </resources>
  <dimensions>
    <name>НематериальныйАктив</name>
    <type>
      <types>CatalogRef.НематериальныеАктивы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ПорядокУчетаНМАУУ/ПорядокУчетаНМАУУ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПорядокУчетаНМАУУ</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияНМА</types>
    </type>
  </resources>
  <resources>
    <name>НачислятьАмортизациюУУ</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СтатьяРасходов</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
    </type>
  </resources>
  <resources>
    <name>АналитикаРасходов</name>
    <type>
      <types>Characteristic.СтатьиРасходов</types>
    </type>
  </resources>
  <resources>
    <name>СпособОтраженияРасходов</name>
    <type>
      <types>DocumentRef.ИзменениеПараметровНМА2_4</types>
    </type>
  </resources>
  <resources>
    <name>ПередаватьРасходыВДругуюОрганизацию</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОрганизацияПолучательРасходов</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <dimensions>
    <name>НематериальныйАктив</name>
    <type>
      <types>CatalogRef.НематериальныеАктивы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Enums/ТипыНалогообложенияНДС/ТипыНалогообложенияНДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ТипыНалогообложенияНДС</name>
  <enumValues>
    <name>НалоговыйАгентПоНДС</name>
  </enumValues>
  <enumValues>
    <name>ПоФактическомуИспользованию</name>
  </enumValues>
  <enumValues>
    <name>ПродажаНаЭкспорт</name>
  </enumValues>
  <enumValues>
    <name>ПродажаНеОблагаетсяНДС</name>
  </enumValues>
  <enumValues>
    <name>ПродажаОблагаетсяЕНВД</name>
  </enumValues>
  <enumValues>
    <name>ПродажаОблагаетсяНДС</name>
  </enumValues>
  <enumValues>
    <name>ЭкспортСырьевыхТоваровУслуг</name>
  </enumValues>
  <enumValues>
    <name>ЭкспортНесырьевыхТоваров</name>
  </enumValues>
  <enumValues>
    <name>ВводОСВЭксплуатацию</name>
  </enumValues>
  <enumValues>
    <name>ОпределяетсяРаспределением</name>
  </enumValues>
  <enumValues>
    <name>ОблагаетсяНДСУПокупателя</name>
  </enumValues>
  <enumValues>
    <name>ПроизводствоСДЦ</name>
  </enumValues>
  <enumValues>
    <name>ЭлектронныеУслуги</name>
  </enumValues>
  <enumValues>
    <name>РеализацияРаботУслугНаЭкспорт</name>
  </enumValues>
  <enumValues>
    <name>ПродажаПоПатенту</name>
  </enumValues>
  <enumValues>
    <name>РеверсивноеОбложениеНДС</name>
  </enumValues>
  <enumValues>
    <name>ОблагаетсяНДССМежценовойРазницы</name>
  </enumValues>
  <enumValues>
    <name>Космос</name>
  </enumValues>
  <enumValues>
    <name>ПродажаОблагаетсяНДСВСтранеЕАЭС</name>
  </enumValues>
  <enumValues>
    <name>ЛьготноеНалогообложениеНДСНаУСН</name>
  </enumValues>
</mdclass:Enum>

src/Documents/ПринятиеКУчетуНМА/ПринятиеКУчетуНМА.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПринятиеКУчетуНМА</name>
  <basedOn>Catalog.НематериальныеАктивы</basedOn>
  <registerRecords>InformationRegister.ПорядокУчетаНМА</registerRecords>
  <registerRecords>AccumulationRegister.ПрочиеРасходы</registerRecords>
  <registerRecords>AccumulationRegister.ПартииПрочихРасходов</registerRecords>
  <registerRecords>InformationRegister.ОтражениеДокументовВРеглУчете</registerRecords>
  <registerRecords>InformationRegister.ПараметрыЦелевогоФинансированияНМА</registerRecords>
  <registerRecords>InformationRegister.ПервоначальныеСведенияНМА</registerRecords>
  <registerRecords>AccumulationRegister.ФактическиеДанныеБюджетирования</registerRecords>
  <registerRecords>AccountingRegister.МеждународныйБезКорреспонденции</registerRecords>
  <registerRecords>AccountingRegister.Хозрасчетный</registerRecords>
  <registerRecords>InformationRegister.ПорядокУчетаНМАБУ</registerRecords>
  <registerRecords>InformationRegister.ОтражениеДокументовВМеждународномУчете</registerRecords>
  <registerRecords>AccountingRegister.Международный</registerRecords>
  <registerRecords>InformationRegister.ПараметрыАмортизацииНМАБУ</registerRecords>
  <registerRecords>InformationRegister.МестоУчетаНМА</registerRecords>
  <registerRecords>AccumulationRegister.ВыручкаИСебестоимостьПродаж</registerRecords>
  <attributes>
    <name>АналитикаДоходов</name>
    <type>
      <types>Characteristic.СтатьиДоходов</types>
    </type>
  </attributes>
  <attributes>
    <name>АналитикаРасходов</name>
    <type>
      <types>Characteristic.СтатьиРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантПримененияЦелевогоФинансирования</name>
    <type>
      <types>EnumRef.ВариантыПримененияЦелевогоФинансирования</types>
    </type>
  </attributes>
  <attributes>
    <name>ВариантРаздельногоУчетаНДС</name>
    <type>
      <types>EnumRef.ВариантыРаздельногоУчетаНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОбъектаУчета</name>
    <type>
      <types>EnumRef.ВидыОбъектовУчетаНМА</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КоэффициентБУ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НалогообложениеНДС</name>
    <type>
      <types>EnumRef.ТипыНалогообложенияНДС</types>
    </type>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>НачислятьАмортизациюБУ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НачислятьАмортизациюНУ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НематериальныйАктив</name>
    <type>
      <types>CatalogRef.НематериальныеАктивы</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъемНаработкиБУ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ОрганизацияПолучательРасходов</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПередаватьРасходыВДругуюОрганизацию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокСписанияНИОКРНаРасходыНУ</name>
    <type>
      <types>EnumRef.ПорядокСписанияНИОКРНУ</types>
    </type>
  </attributes>
  <attributes>
    <name>ПорядокУчетаНУ</name>
    <type>
      <types>EnumRef.ПорядокВключенияСтоимостиОСВСоставРасходовНУ</types>
    </type>
  </attributes>
  <attributes>
    <name>СпециальныйКоэффициентНУ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпособНачисленияАмортизацииБУ</name>
    <type>
      <types>EnumRef.СпособыНачисленияАмортизацииНМА</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособПоступления</name>
    <type>
      <types>EnumRef.СпособыПоступленияАктивов</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокИспользованияБУ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокИспользованияНУ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДоходов</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиДоходов</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяРасходов</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.СтатьиРасходов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаЦелевыхСредств</name>
    <type>
      <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетАмортизацииЦФ</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетНачисленияАмортизации</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетПередачиРасходов</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчета</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетУчетаЦФ</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ЦелевоеФинансирование</name>
    <attributes>
      <name>Счет</name>
      <type>
        <types>ChartOfAccountsRef.Хозрасчетный</types>
      </type>
    </attributes>
    <attributes>
      <name>Субконто1</name>
      <type>
        <types>Characteristic.ВидыСубконтоХозрасчетные</types>
      </type>
    </attributes>
    <attributes>
      <name>Субконто2</name>
      <type>
        <types>Characteristic.ВидыСубконтоХозрасчетные</types>
      </type>
    </attributes>
    <attributes>
      <name>Субконто3</name>
      <type>
        <types>Characteristic.ВидыСубконтоХозрасчетные</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>DefinedType.ДенежнаяСуммаНеотрицательная</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/InformationRegisters/ПорядокУчетаНМАБУ/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// Параметры:
//   Ограничение - см. УправлениеДоступомПереопределяемый.ПриЗаполненииОграниченияДоступа.Ограничение.
//
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ОбновлениеИнформационнойБазы

// см. ОбновлениеИнформационнойБазыБСП.ПриДобавленииОбработчиковОбновления
Процедура ПриДобавленииОбработчиковОбновления(Обработчики) Экспорт

	Обработчик = Обработчики.Добавить();
	Обработчик.Процедура = "РегистрыСведений.ПорядокУчетаНМАБУ.ОбработатьДанныеДляПереходаНаНовуюВерсию";
	Обработчик.Версия = "2.5.15.29";
	Обработчик.РежимВыполнения = "Отложенно";
	Обработчик.Идентификатор = Новый УникальныйИдентификатор("e6b0c3d6-5441-4a70-bf31-ff8d2dc640cf");
	Обработчик.ПроцедураЗаполненияДанныхОбновления = "РегистрыСведений.ПорядокУчетаНМАБУ.ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию";
	Обработчик.ПроцедураПроверки = "ОбновлениеИнформационнойБазы.ДанныеОбновленыНаНовуюВерсиюПрограммы";
	Обработчик.Порядок = Перечисления.ПорядокОбработчиковОбновления.Обычный;
	Если ПолучитьФункциональнуюОпцию("ЛокализацияРФ") Тогда
		Обработчик.Комментарий = НСтр("ru = 'Обновляет регистр ""Порядок учета НМА (БУ)"":
		|- заполняет новые ресурсы ""Состояние (НУ)"", ""Налогообложение""';
		|en = 'Updates the ""IA accounting procedure (LA)"" register:
		|- Fills the new resources: ""State (TA)"", ""Taxation""'");
	Иначе
		Обработчик.Комментарий = НСтр("ru = 'Обновляет регистр ""Порядок учета НМА (БУ)"":
		|- заполняет регистр по данным упр. учета';
		|en = 'Updates the ""IA accounting procedure (LA)"" register:
		|- Fills the register based on management accounting data'");
	КонецЕсли;
	
	Читаемые = Новый Массив;
	Читаемые.Добавить(Метаданные.Документы.ВводОстатковВнеоборотныхАктивов2_4.ПолноеИмя());
	Читаемые.Добавить(Метаданные.Документы.ИзменениеПараметровНМА2_4.ПолноеИмя());
	Читаемые.Добавить(Метаданные.Документы.ПеремещениеНМА2_4.ПолноеИмя());
	Читаемые.Добавить(Метаданные.Документы.ПодготовкаКПередачеНМА2_4.ПолноеИмя());
	Читаемые.Добавить(Метаданные.Документы.ПринятиеКУчетуНМА2_4.ПолноеИмя());
	Читаемые.Добавить(Метаданные.Документы.СписаниеНМА2_4.ПолноеИмя());
	Читаемые.Добавить(Метаданные.РегистрыСведений.ПорядокУчетаНМАБУ.ПолноеИмя());
	Обработчик.ЧитаемыеОбъекты = СтрСоединить(Читаемые, ",");
	
	Изменяемые = Новый Массив;
	Изменяемые.Добавить(Метаданные.РегистрыСведений.ПорядокУчетаНМАБУ.ПолноеИмя());
	Обработчик.ИзменяемыеОбъекты = СтрСоединить(Изменяемые, ",");
	
	Блокируемые = Новый Массив;
	Блокируемые.Добавить(Метаданные.РегистрыСведений.ПорядокУчетаНМАБУ.ПолноеИмя());
	Обработчик.БлокируемыеОбъекты = СтрСоединить(Блокируемые, ",");

КонецПроцедуры

// Параметры:
// 	Параметры - см. ОбновлениеИнформационнойБазы.ОсновныеПараметрыОтметкиКОбработке
//
Процедура ЗарегистрироватьДанныеКОбработкеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	ПолноеИмяОбъекта = "РегистрСведений.ПорядокУчетаНМАБУ";
	
	ТекстЗапроса = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДанныеКОбновлению.Регистратор
	|ИЗ
	|	(ВЫБРАТЬ
	|		РегистрИсточник.Регистратор КАК Регистратор
	|	ИЗ
	|		РегистрСведений.ПорядокУчетаНМАУУ КАК РегистрИсточник
	|
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПорядокУчетаНМАБУ КАК РегистрПриемник
	|			ПО РегистрПриемник.Регистратор = РегистрИсточник.Регистратор
	|	ГДЕ
	|		РегистрПриемник.Регистратор ЕСТЬ NULL
	|		И &ЭтоМеждународнаяВерсия
	|		И НЕ &РеглУчетВНАВедетсяНезависимо
	|		И НЕ РегистрИсточник.Регистратор ССЫЛКА Документ.КорректировкаРегистров
	|
	//++ Локализация
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		РегистрИсточник.Регистратор КАК Регистратор
	|	ИЗ
	|		РегистрСведений.ПорядокУчетаНМАБУ КАК РегистрИсточник
	|	ГДЕ
	|		НЕ &ЭтоМеждународнаяВерсия
	|		И РегистрИсточник.СостояниеНУ = ЗНАЧЕНИЕ(Перечисление.СостоянияНМА.ПустаяСсылка)
	|		И РегистрИсточник.СостояниеБУ В (
	|			ЗНАЧЕНИЕ(Перечисление.СостоянияНМА.ПринятКУчету),
	|			ЗНАЧЕНИЕ(Перечисление.СостоянияНМА.Списан))
	|		И НЕ РегистрИсточник.Регистратор ССЫЛКА Документ.КорректировкаРегистров
	|
	|		И ИСТИНА В (
	|			ВЫБРАТЬ ПЕРВЫЕ 1
	|				ИСТИНА
	|			ИЗ
	|				Документ.ПринятиеКУчетуНМА2_4 КАК ДанныеДокумента
	|			ГДЕ
	|				ДанныеДокумента.Проведен
	|				И ДанныеДокумента.НематериальныйАктив = РегистрИсточник.НематериальныйАктив
	|				И (ДанныеДокумента.ОтражатьВРеглУчете
	|						И НЕ ДанныеДокумента.ОтражатьВБУ
	|						И НЕ ДанныеДокумента.ОтражатьВНУ
	|					ИЛИ ДанныеДокумента.ОтражатьВНУ)
	|
	|			ОБЪЕДИНИТЬ ВСЕ
	|
	|			ВЫБРАТЬ ПЕРВЫЕ 1
	|				ИСТИНА
	|			ИЗ
	|				Документ.ПринятиеКУчетуНМА КАК ДанныеДокумента
	|			ГДЕ
	|				ДанныеДокумента.Проведен
	|				И ДанныеДокумента.НематериальныйАктив = РегистрИсточник.НематериальныйАктив
	|
	|			ОБЪЕДИНИТЬ ВСЕ
	|
	|			ВЫБРАТЬ ПЕРВЫЕ 1
	|				ИСТИНА
	|			ИЗ
	|				Документ.ВводОстатковВнеоборотныхАктивов2_4.НМА КАК ДанныеДокумента
	|			ГДЕ
	|				ДанныеДокумента.Ссылка.Проведен
	|				И ДанныеДокумента.НематериальныйАктив = РегистрИсточник.НематериальныйАктив
	|				И (ДанныеДокумента.Ссылка.ОтражатьВРеглУчете
	|						И НЕ ДанныеДокумента.Ссылка.ОтражатьВБУ
	|						И НЕ ДанныеДокумента.Ссылка.ОтражатьВНУ
	|					ИЛИ ДанныеДокумента.Ссылка.ОтражатьВНУ)
	|
	|			ОБЪЕДИНИТЬ ВСЕ
	|
	|			ВЫБРАТЬ ПЕРВЫЕ 1
	|				ИСТИНА
	|			ИЗ
	|				Документ.ВводОстатковВнеоборотныхАктивов.НМА КАК ДанныеДокумента
	|			ГДЕ
	|				ДанныеДокумента.Ссылка.Проведен
	|				И ДанныеДокумента.НематериальныйАктив = РегистрИсточник.НематериальныйАктив
	|				)
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		РегистрИсточник.Регистратор КАК Регистратор
	|	ИЗ
	|		РегистрСведений.ПорядокУчетаНМАБУ КАК РегистрИсточник
	|	ГДЕ
	|		НЕ &ЭтоМеждународнаяВерсия
	|		И РегистрИсточник.НалогообложениеНДС = ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)
	|
	|		И (РегистрИсточник.Регистратор ССЫЛКА Документ.ПеремещениеНМА2_4
	|			ИЛИ РегистрИсточник.Регистратор ССЫЛКА Документ.ИзменениеПараметровНМА2_4
	|			ИЛИ РегистрИсточник.Регистратор ССЫЛКА Документ.ИзменениеПараметровНМА
	|			ИЛИ РегистрИсточник.Регистратор ССЫЛКА Документ.ПринятиеКУчетуНМА2_4
	|			ИЛИ РегистрИсточник.Регистратор ССЫЛКА Документ.ПринятиеКУчетуНМА)
	|
	|		И ИСТИНА В (
	|			ВЫБРАТЬ ПЕРВЫЕ 1
	|				ИСТИНА
	|			ИЗ
	|				Документ.ПринятиеКУчетуНМА2_4 КАК ДанныеДокумента
	|			ГДЕ
	|				ДанныеДокумента.Проведен
	|				И ДанныеДокумента.НематериальныйАктив = РегистрИсточник.НематериальныйАктив
	|				И ВЫБОР
	|					КОГДА ДанныеДокумента.ВариантРаздельногоУчетаНДС = ЗНАЧЕНИЕ(Перечисление.ВариантыРаздельногоУчетаНДС.Распределение)
	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ОпределяетсяРаспределением)
	|					ИНАЧЕ ДанныеДокумента.НалогообложениеНДС
	|					КОНЕЦ <> ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)
	|
	|			ОБЪЕДИНИТЬ ВСЕ
	|			
	|			ВЫБРАТЬ ПЕРВЫЕ 1
	|				ИСТИНА
	|			ИЗ
	|				Документ.ПринятиеКУчетуНМА КАК ДанныеДокумента
	|			ГДЕ
	|				ДанныеДокумента.Проведен
	|				И ДанныеДокумента.НематериальныйАктив = РегистрИсточник.НематериальныйАктив
	|				И ВЫБОР
	|					КОГДА ДанныеДокумента.ВариантРаздельногоУчетаНДС = ЗНАЧЕНИЕ(Перечисление.ВариантыРаздельногоУчетаНДС.Распределение)
	|						ТОГДА ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ОпределяетсяРаспределением)
	|					ИНАЧЕ ДанныеДокумента.НалогообложениеНДС
	|					КОНЕЦ <> ЗНАЧЕНИЕ(Перечисление.ТипыНалогообложенияНДС.ПустаяСсылка)
	|
	|		)
	|		
	//-- Локализация
	|
	|	) КАК ДанныеКОбновлению";
	
	Запрос = Новый Запрос(ТекстЗапроса);
	Запрос.УстановитьПараметр("ЭтоМеждународнаяВерсия", НЕ ПолучитьФункциональнуюОпцию("ЛокализацияРФ"));
	Запрос.УстановитьПараметр("РеглУчетВНАВедетсяНезависимо", НастройкиНалоговУчетныхПолитикПовтИсп.РеглУчетВНАВедетсяНезависимо());

	Регистраторы = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Регистратор");
	ОбновлениеИнформационнойБазы.ОтметитьРегистраторыКОбработке(Параметры, Регистраторы, ПолноеИмяОбъекта);
	
КонецПроцедуры

Процедура ОбработатьДанныеДляПереходаНаНовуюВерсию(Параметры) Экспорт
	
	Замер = ОценкаПроизводительности.НачатьЗамерДлительнойОперации(
		"РегистрСведений.ПорядокУчетаНМАБУ.ОбработатьДанныеДляПереходаНаНовуюВерсию");

	ОбъектовОбработано = ВнеоборотныеАктивы.СформироватьДвиженияПриОбновленииИБ("ПорядокУчетаНМАБУ", Параметры);
	
	ОценкаПроизводительности.ЗакончитьЗамерДлительнойОперации(Замер, ОбъектовОбработано);	
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
